# <center> Analiza i Bazy Danych </center>

<center>Laboratorium 2

Szymon Szewczyk gr.7

Połączenie z bazą danych przy pomocy sqlAlchemy

In [205]:
from sqlalchemy import create_engine
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

## Zadanie 1

In [206]:
df_1 = pd.read_sql('select count(distinct category_id) from film_category;',con=connection)
df_1

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/963219455.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_1 = pd.read_sql('select count(distinct category_id) from film_category;',con=connection)

   count
0     16

W Wypożyczalni mamy 16 kategorii filmów

## Zadanie 2

In [207]:
df_2 = pd.read_sql('select name from category order by name asc;', con=connection)
df_2

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/2275854022.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2 = pd.read_sql('select name from category order by name asc;', con=connection)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 3

In [208]:
df_3 = pd.read_sql('select title, release_year from film order by release_year asc;', con=connection)
df_3

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/145072069.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_3 = pd.read_sql('select title, release_year from film order by release_year asc;', con=connection)

                 title  release_year
0      Chamber Italian          2006
1     Grosse Wonderful          2006
2      Airport Pollock          2006
3    Bright Encounters          2006
4     Academy Dinosaur          2006
..                 ...           ...
995     Young Language          2006
996         Youth Kick          2006
997       Zhivago Core          2006
998  Zoolander Fiction          2006
999          Zorro Ark          2006

[1000 rows x 2 columns]

Najstarszy film to "chamber Italian" a najmłodszy to "Zorro Ark"

## Zadanie 4

In [209]:
df_4 = pd.read_sql("select count(rental_date) from rental where rental_date BETWEEN '2005-07-01 00:00:00' AND '2005-08-01 00:00:00';",con=connection)
df_4

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/2093123427.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_4 = pd.read_sql("select count(rental_date) from rental where rental_date BETWEEN '2005-07-01 00:00:00' AND '2005-08-01 00:00:00';",con=connection)

   count
0   6709

Między 2005-07-01 a 2005-08-01 odbyło się 6709 wypożyczeń

## Zadanie 5

In [210]:
df_5 = pd.read_sql("select count(rental_date) from rental where rental_date BETWEEN '2010-01-01 00:00:00' AND '2011-02-01 00:00:00';",con=connection)
df_5

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/677947830.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_5 = pd.read_sql("select count(rental_date) from rental where rental_date BETWEEN '2010-01-01 00:00:00' AND '2011-02-01 00:00:00';",con=connection)

   count
0      0

Między 2010-01-01 a 2011-02-01 nie odbyło się ani jedno wypożyczenie

## Zadanie 6

In [211]:
df_6 = pd.read_sql("select max(amount) from payment;",con=connection)
df_6

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/3319600133.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_6 = pd.read_sql("select max(amount) from payment;",con=connection)

     max
0  11.99

Największa płatność wyniosła 11.99

## Zadanie 7

In [212]:
df_7 = pd.read_sql("SELECT customer.first_name, customer.last_name, country.country FROM customer \
    INNER JOIN address ON customer.address_id = address.address_id \
    INNER JOIN city ON address.city_id = city.city_id \
    INNER JOIN country ON city.country_id = country.country_id \
    WHERE country = 'Poland' or country = 'Nigeria' or country = 'Bangladesh' \
    ORDER BY country;", con=connection)
df_7

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/3153737642.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_7 = pd.read_sql("SELECT customer.first_name, customer.last_name, country.country FROM customer \

   first_name  last_name     country
0    Michelle      Clark  Bangladesh
1     Stephen     Qualls  Bangladesh
2       Frank   Waggoner  Bangladesh
3     Marilyn       Ross     Nigeria
4       Elsie     Kelley     Nigeria
5      Gladys   Hamilton     Nigeria
6       Sonia    Gregory     Nigeria
7      Rodney    Moeller     Nigeria
8       Velma      Lucas     Nigeria
9       Carol     Garcia     Nigeria
10       Olga    Jimenez     Nigeria
11     Bertha   Ferguson     Nigeria
12     Tracey    Barrett     Nigeria
13         Jo     Fowler     Nigeria
14    Wallace      Slone     Nigeria
15  Constance       Reid     Nigeria
16      Brian      Wyman      Poland
17     Sidney   Burleson      Poland
18   Marjorie     Tucker      Poland
19    Russell    Brinson      Poland
20       Leah     Curtis      Poland
21      Ruben      Geary      Poland
22    Johnnie   Chisholm      Poland
23     Jimmie  Eggleston      Poland

## Zadanie 8

In [213]:
df_8 = pd.read_sql("SELECT staff.first_name, staff.last_name, city.city, country.country FROM staff \
    INNER JOIN address ON staff.address_id = address.address_id \
    INNER JOIN city ON address.city_id = city.city_id \
    INNER JOIN country ON city.country_id = country.country_id;", con=connection)
df_8

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/2772008543.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_8 = pd.read_sql("SELECT staff.first_name, staff.last_name, city.city, country.country FROM staff \

  first_name last_name        city    country
0       Mike   Hillyer  Lethbridge     Canada
1        Jon  Stephens   Woodridge  Australia

Członkowie personelu mieszkają w Lethbridge w Kanadzie oraz w Woodbridge w Australii

## Zadanie 9

In [214]:
df_9 = pd.read_sql("SELECT staff.first_name, staff.last_name, country.country FROM staff \
    INNER JOIN address ON staff.address_id = address.address_id \
    INNER JOIN city ON address.city_id = city.city_id \
    INNER JOIN country ON city.country_id = country.country_id \
    WHERE country = 'Spain' or country = 'Argentina' \
    ORDER BY country;", con=connection)
df_9

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/2441305396.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_9 = pd.read_sql("SELECT staff.first_name, staff.last_name, country.country FROM staff \

Empty DataFrame
Columns: [first_name, last_name, country]
Index: []

Żaden z pracowników nie mieszka w Argentynie lub Hiszpani

## Zadanie 10

In [215]:
df_10 = pd.read_sql("SELECT name FROM category;", con=connection)
df_10

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/1816472911.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_10 = pd.read_sql("SELECT name FROM category;", con=connection)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 11

In [216]:
df_11 = pd.read_sql("SELECT DISTINCT name FROM category \
    INNER JOIN film_category ON category.category_id = film_category.category_id \
    INNER JOIN film ON film_category.film_id = film.film_id \
    INNER JOIN inventory ON film.film_id = inventory.film_id \
    INNER JOIN rental ON inventory.inventory_id = rental.inventory_id \
    INNER JOIN customer ON rental.customer_id = customer.customer_id \
    INNER JOIN address ON customer.address_id = address.address_id \
    INNER JOIN city ON address.city_id = city.city_id \
    INNER JOIN country ON city.country_id = country.country_id \
    WHERE country = 'United States';", con=connection)
df_11

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/1066344683.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_11 = pd.read_sql("SELECT DISTINCT name FROM category \

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 12

In [217]:
df_12 = pd.read_sql("SELECT title FROM film \
    INNER JOIN film_actor ON film.film_id = film_actor.film_id \
    INNER JOIN actor ON film_actor.actor_id = actor.actor_id \
    WHERE first_name = 'Olympia' and last_name = 'Pfeiffer' or first_name = 'Julia' and last_name = 'Zellweger' or \
    first_name = 'Ellen' and last_name = 'Presley';", con=connection)
df_12

C:\Users\szyme\AppData\Local\Temp/ipykernel_25788/3983467085.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_12 = pd.read_sql("SELECT title FROM film \

                title
0     Bilko Anonymous
1   Caribbean Liberty
2    Casper Dragonfly
3    Empire Malkovich
4       Floats Garden
..                ...
64       Outlaw Hanky
65    Panky Submarine
66   Rider Caddyshack
67          Won Dares
68      Wyoming Storm

[69 rows x 1 columns]